p2p-bench/results/2026-06-16_5060ti-16gb_2cards_gen3-x4_p2p-sweep-c1-2-4-8/scenarios/p2p_off-c8/run_2.stdout.txt
WARNING 06-16 20:31:10 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e783405f240>, trust_remote_code=False, seed=1234, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8081', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='p2p_off-c8', input_len=None, output_len=None, tokenizer='/data/models/qwen3.6-27b-text-nvfp4-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run1/scenarios/p2p_off-c8', result_filename='run_2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-040000c3-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 20:31:16 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  794.98    
Total input tokens:                      131072    
Total generated tokens:                  131072    
Request throughput (req/s):              0.16      
Output token throughput (tok/s):         164.87    
Peak output token throughput (tok/s):    75.00     
Peak concurrent requests:                9.00      
Total token throughput (tok/s):          329.75    
---------------Time to First Token----------------
Mean TTFT (ms):                          18605.96  
Median TTFT (ms):                        19302.37  
P50 TTFT (ms):                           19302.37  
P90 TTFT (ms):                           24902.60  
P99 TTFT (ms):                           31177.23  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.39     
Median TPOT (ms):                        27.53     
P50 TPOT (ms):                           27.53     
P90 TPOT (ms):                           34.21     
P99 TPOT (ms):                           68.64     
---------------Inter-token Latency----------------
Mean ITL (ms):                           79.67     
Median ITL (ms):                         70.77     
P50 ITL (ms):                            70.77     
P90 ITL (ms):                            71.14     
P99 ITL (ms):                            936.16    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          47649.54  
Median E2EL (ms):                        46454.26  
P50 E2EL (ms):                           46454.26  
P90 E2EL (ms):                           59758.80  
P99 E2EL (ms):                           87535.53  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:23<02:41, 23.02s/it]
 25%|██▌       | 2/8 [00:24<01:01, 10.29s/it]
 38%|███▊      | 3/8 [00:26<00:32,  6.47s/it]
 50%|█████     | 4/8 [00:33<00:27,  6.84s/it]
 62%|██████▎   | 5/8 [00:34<00:14,  4.80s/it]
 75%|███████▌  | 6/8 [00:43<00:12,  6.10s/it]
 88%|████████▊ | 7/8 [00:47<00:05,  5.34s/it]
100%|██████████| 8/8 [00:51<00:00,  4.90s/it]
100%|██████████| 8/8 [00:51<00:00,  6.41s/it]

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:24<50:50, 24.02s/it]
  2%|▏         | 2/128 [00:28<25:46, 12.28s/it]
  2%|▏         | 3/128 [00:29<15:40,  7.52s/it]
  3%|▎         | 4/128 [00:33<12:04,  5.84s/it]
  4%|▍         | 5/128 [00:40<13:13,  6.45s/it]
  5%|▍         | 6/128 [00:53<17:42,  8.71s/it]
  5%|▌         | 7/128 [00:55<13:11,  6.54s/it]
  6%|▋         | 8/128 [01:02<13:04,  6.54s/it]
  7%|▋         | 9/128 [01:05<10:40,  5.38s/it]
  8%|▊         | 10/128 [01:13<12:15,  6.23s/it]
  9%|▊         | 11/128 [01:16<10:32,  5.40s/it]
  9%|▉         | 12/128 [01:25<12:06,  6.26s/it]
 10%|█         | 13/128 [01:28<10:24,  5.43s/it]
 11%|█         | 14/128 [01:42<15:01,  7.90s/it]
 12%|█▏        | 15/128 [01:44<11:41,  6.21s/it]
 12%|█▎        | 16/128 [01:49<10:39,  5.71s/it]
 13%|█▎        | 17/128 [01:51<08:36,  4.66s/it]
 14%|█▍        | 18/128 [02:04<13:05,  7.14s/it]
 15%|█▍        | 19/128 [02:14<14:27,  7.96s/it]
 16%|█▌        | 20/128 [02:17<12:05,  6.72s/it]
 16%|█▋        | 21/128 [02:18<08:55,  5.00s/it]
 17%|█▋        | 22/128 [02:21<07:39,  4.33s/it]
 18%|█▊        | 23/128 [02:34<11:49,  6.76s/it]
 19%|█▉        | 24/128 [02:37<09:45,  5.63s/it]
 20%|█▉        | 25/128 [02:41<08:57,  5.22s/it]
 20%|██        | 26/128 [02:42<06:47,  4.00s/it]
 21%|██        | 27/128 [02:44<05:48,  3.45s/it]
 22%|██▏       | 28/128 [02:59<11:36,  6.97s/it]
 23%|██▎       | 29/128 [03:05<10:49,  6.56s/it]
 23%|██▎       | 30/128 [03:07<08:29,  5.20s/it]
 24%|██▍       | 31/128 [03:14<09:07,  5.65s/it]
 25%|██▌       | 32/128 [03:16<07:31,  4.70s/it]
 26%|██▌       | 33/128 [03:26<09:43,  6.14s/it]
 27%|██▋       | 34/128 [03:29<08:08,  5.19s/it]
 27%|██▋       | 35/128 [03:36<09:13,  5.95s/it]
 28%|██▊       | 36/128 [03:38<07:18,  4.76s/it]
 29%|██▉       | 37/128 [03:44<07:42,  5.08s/it]
 30%|██▉       | 38/128 [03:52<08:46,  5.85s/it]
 30%|███       | 39/128 [03:54<07:01,  4.74s/it]
 31%|███▏      | 40/128 [04:04<09:23,  6.40s/it]
 32%|███▏      | 41/128 [04:06<07:10,  4.95s/it]
 33%|███▎      | 42/128 [04:16<09:11,  6.42s/it]
 34%|███▎      | 43/128 [04:19<07:38,  5.39s/it]
 34%|███▍      | 44/128 [04:27<08:44,  6.24s/it]
 35%|███▌      | 45/128 [04:31<07:38,  5.53s/it]
 36%|███▌      | 46/128 [04:37<07:45,  5.68s/it]
 37%|███▋      | 47/128 [04:47<09:18,  6.89s/it]
 38%|███▊      | 48/128 [04:51<08:16,  6.21s/it]
 38%|███▊      | 49/128 [04:55<07:14,  5.50s/it]
 39%|███▉      | 50/128 [05:01<07:11,  5.54s/it]
 40%|███▉      | 51/128 [05:03<05:55,  4.62s/it]
 41%|████      | 52/128 [05:16<09:03,  7.15s/it]
 41%|████▏     | 53/128 [05:19<07:22,  5.89s/it]
 42%|████▏     | 54/128 [05:25<07:14,  5.87s/it]
 43%|████▎     | 55/128 [05:30<06:49,  5.61s/it]
 44%|████▍     | 56/128 [05:31<05:08,  4.29s/it]
 45%|████▍     | 57/128 [05:42<07:19,  6.19s/it]
 45%|████▌     | 58/128 [05:47<06:48,  5.84s/it]
 46%|████▌     | 59/128 [05:53<06:52,  5.98s/it]
 47%|████▋     | 60/128 [05:55<05:15,  4.64s/it]
 48%|████▊     | 61/128 [06:02<06:03,  5.42s/it]
 48%|████▊     | 62/128 [06:17<09:07,  8.29s/it]
 49%|████▉     | 63/128 [06:19<07:07,  6.58s/it]
 50%|█████     | 64/128 [06:21<05:15,  4.93s/it]
 51%|█████     | 65/128 [06:25<05:10,  4.92s/it]
 52%|█████▏    | 66/128 [06:35<06:23,  6.19s/it]
 52%|█████▏    | 67/128 [06:42<06:48,  6.70s/it]
 53%|█████▎    | 68/128 [06:44<05:08,  5.14s/it]
 54%|█████▍    | 69/128 [06:52<05:59,  6.09s/it]
 55%|█████▍    | 70/128 [07:03<07:18,  7.56s/it]
 55%|█████▌    | 71/128 [07:05<05:24,  5.70s/it]
 56%|█████▋    | 72/128 [07:14<06:24,  6.86s/it]
 57%|█████▋    | 73/128 [07:22<06:40,  7.27s/it]
 58%|█████▊    | 74/128 [07:27<05:56,  6.60s/it]
 59%|█████▊    | 75/128 [07:37<06:31,  7.39s/it]
 59%|█████▉    | 76/128 [07:41<05:34,  6.43s/it]
 60%|██████    | 77/128 [07:46<05:01,  5.92s/it]
 61%|██████    | 78/128 [07:51<04:41,  5.63s/it]
 62%|██████▏   | 79/128 [07:54<04:08,  5.08s/it]
 62%|██████▎   | 80/128 [08:09<06:20,  7.93s/it]
 63%|██████▎   | 81/128 [08:12<05:03,  6.45s/it]
 64%|██████▍   | 82/128 [08:15<04:06,  5.35s/it]
 65%|██████▍   | 83/128 [08:16<03:04,  4.09s/it]
 66%|██████▌   | 84/128 [08:25<04:10,  5.69s/it]
 66%|██████▋   | 85/128 [08:35<05:00,  6.98s/it]
 67%|██████▋   | 86/128 [08:37<03:45,  5.36s/it]
 68%|██████▊   | 87/128 [08:43<03:50,  5.63s/it]
 69%|██████▉   | 88/128 [08:51<04:11,  6.28s/it]
 70%|██████▉   | 89/128 [08:54<03:33,  5.46s/it]
 70%|███████   | 90/128 [09:07<04:48,  7.59s/it]
 71%|███████   | 91/128 [09:09<03:40,  5.97s/it]
 72%|███████▏  | 92/128 [09:12<03:00,  5.00s/it]
 73%|███████▎  | 93/128 [09:22<03:46,  6.47s/it]
 73%|███████▎  | 94/128 [09:37<05:10,  9.14s/it]
 74%|███████▍  | 95/128 [09:40<04:00,  7.29s/it]
 75%|███████▌  | 96/128 [09:43<03:14,  6.07s/it]
 76%|███████▌  | 97/128 [09:48<02:50,  5.51s/it]
 77%|███████▋  | 98/128 [10:02<04:08,  8.30s/it]
 77%|███████▋  | 99/128 [10:05<03:07,  6.47s/it]
 78%|███████▊  | 100/128 [10:06<02:19,  5.00s/it]
 79%|███████▉  | 101/128 [10:13<02:29,  5.52s/it]
 80%|███████▉  | 102/128 [10:18<02:20,  5.42s/it]
 80%|████████  | 103/128 [10:28<02:46,  6.67s/it]
 81%|████████▏ | 104/128 [10:32<02:21,  5.88s/it]
 82%|████████▏ | 105/128 [10:38<02:19,  6.06s/it]
 83%|████████▎ | 106/128 [10:48<02:37,  7.16s/it]
 84%|████████▎ | 107/128 [10:50<01:58,  5.65s/it]
 84%|████████▍ | 108/128 [10:54<01:41,  5.09s/it]
 85%|████████▌ | 109/128 [11:03<01:58,  6.22s/it]
 86%|████████▌ | 110/128 [11:08<01:47,  5.95s/it]
 87%|████████▋ | 111/128 [11:12<01:33,  5.49s/it]
 88%|████████▊ | 112/128 [11:18<01:28,  5.54s/it]
 88%|████████▊ | 113/128 [11:23<01:18,  5.23s/it]
 89%|████████▉ | 114/128 [11:35<01:41,  7.25s/it]
 90%|████████▉ | 115/128 [11:36<01:10,  5.44s/it]
 91%|█████████ | 116/128 [11:39<00:57,  4.83s/it]
 91%|█████████▏| 117/128 [11:41<00:44,  4.04s/it]
 92%|█████████▏| 118/128 [11:55<01:07,  6.78s/it]
 93%|█████████▎| 119/128 [12:09<01:22,  9.21s/it]
 94%|█████████▍| 120/128 [12:13<01:00,  7.56s/it]
 95%|█████████▍| 121/128 [12:18<00:46,  6.68s/it]
 95%|█████████▌| 122/128 [12:25<00:41,  6.91s/it]
 96%|█████████▌| 123/128 [12:39<00:44,  8.98s/it]
 97%|█████████▋| 124/128 [12:41<00:27,  6.84s/it]
 98%|█████████▊| 125/128 [12:42<00:15,  5.20s/it]
 99%|█████████▉| 127/128 [12:54<00:05,  5.53s/it]
100%|██████████| 128/128 [13:14<00:00,  9.21s/it]
100%|██████████| 128/128 [13:14<00:00,  6.21s/it]